## Table of Contents:
#### 01. Importing Libraries
#### 02. Importing the datasets
#### 03. Doing Consistency Checks of the 'df_prods' dataframe
#### 04. Doing Consistency Checks of the 'df_ords' dataframe

## 01. Importing Libraries

In [1]:
# importing libraries

import pandas as pd
import numpy as np
import os

## 02. Importing the datasets

In [2]:
# defining the path

path=r'/Users/sanju/Documents/Jul 2023 Instacart Basket Analysis/02 Data'

In [13]:
# importing the 'products.csv' dataset

df_prods=pd.read_csv(os.path.join(path,'Original Data','products.csv'),index_col=False)

In [5]:
# importing the 'orders_wrangled.csv' dataset

df_ords=pd.read_csv(os.path.join(path,'Prepared Data','orders_wrangled.csv'),index_col=0)

## 03. Doing Consistency Checks of the 'df_prods' dataframe

In [6]:
# creating a new dataframe

df_test=pd.DataFrame()

In [7]:
# creating a mixed-type column

df_test['mix']=['a','b',1,True]

In [8]:
df_test.head()

    mix
0     a
1     b
2     1
3  True

In [9]:
# checking mixed-type columns

for col in df_test.columns.tolist():
  weird = (df_test[[col]].applymap(type) != df_test[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_test[weird]) > 0:
    print (col)

mix

In [15]:
# checking missing values in 'df_prods' dataframe

df_prods.isnull().sum()

product_id        0
product_name     16
aisle_id          0
department_id     0
prices            0
dtype: int64

In [14]:
df_prods.head()

,product_id,product_name,aisle_id,department_id,prices
0,1,Chocolate Sandwich Cookies,61,19,5.8
1,2,All-Seasons Salt,104,13,9.3
2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,5,Green Chile Anytime Sauce,5,13,4.3

In [16]:
# creating a subset with missing values

df_nan=df_prods[df_prods['product_name'].isnull()==True]

In [17]:
df_nan

       product_id product_name  aisle_id  department_id  prices
33             34          NaN       121             14    12.2
68             69          NaN        26              7    11.8
115           116          NaN        93              3    10.8
261           262          NaN       110             13    12.1
525           525          NaN       109             11     1.2
1511         1511          NaN        84             16    14.3
1780         1780          NaN       126             11    12.3
2240         2240          NaN        52              1    14.2
2586         2586          NaN       104             13    12.4
3159         3159          NaN       126             11    13.1
3230         3230          NaN       120             16    14.4
3736         3736          NaN        41              8    14.8
4283         4283          NaN        77              7    14.4
4790         4790          NaN        91             16    14.5
38187       38183          NaN        39             12    20.9
40444       40440          NaN       120             16    14.8

In [19]:
# creating a subset without the missing values in the 'product_name' column

df_prods_clean=df_prods[df_prods['product_name'].isnull()==False]

In [20]:
df_prods_clean.shape

(49677, 5)

In [21]:
# alternatively, directly deleting the missing value rows from df_prods

df_prods.dropna(subset=['product_name'],inplace=True)

In [22]:
df_prods.shape

(49677, 5)

In [23]:
# creating a subset to check the duplicate rows

df_dups=df_prods_clean[df_prods_clean.duplicated()]

In [24]:
df_dups

,product_id,product_name,aisle_id,department_id,prices
462,462,Fiber 4g Gummy Dietary Supplement,70,11,4.8
18459,18458,Ranger IPA,27,5,9.2
26810,26808,Black House Coffee Roasty Stout Beer,27,5,13.4
35309,35306,Gluten Free Organic Peanut Butter & Chocolate ...,121,14,6.8
35495,35491,Adore Forever Body Wash,127,11,9.9

In [25]:
# deleting the duplicate rows

df_prods_clean_no_dups=df_prods_clean.drop_duplicates()

In [26]:
df_prods_clean_no_dups.shape

(49672, 5)

In [27]:
# exporting the cleaned 'df_prods_clean_no_dups' dataframe

df_prods_clean_no_dups.to_csv(os.path.join(path,'Prepared Data','prods_checked.csv'))

## 04. Doing Consistency Checks of the 'df_ords' dataframe

In [28]:
df_ords.describe()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order
count,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.214874e+06
mean,1.710542e+06,1.029782e+05,1.715486e+01,2.776219e+00,1.345202e+01,1.111484e+01
std,9.875817e+05,5.953372e+04,1.773316e+01,2.046829e+00,4.226088e+00,9.206737e+00
min,1.000000e+00,1.000000e+00,1.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00
25%,8.552715e+05,5.139400e+04,5.000000e+00,1.000000e+00,1.000000e+01,4.000000e+00
50%,1.710542e+06,1.026890e+05,1.100000e+01,3.000000e+00,1.300000e+01,7.000000e+00
75%,2.565812e+06,1.543850e+05,2.300000e+01,5.000000e+00,1.600000e+01,1.500000e+01
max,3.421083e+06,2.062090e+05,1.000000e+02,6.000000e+00,2.300000e+01,3.000000e+01

#### all the columns of the df_ords dataframe (the min. and max. values, mean,median) looks fine to me.

In [31]:
# checking mixed-data type of df_ords

for col in df_ords.columns.tolist():
  weird = (df_ords[[col]].applymap(type) != df_ords[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_ords[weird]) > 0:
    print (col)

#### no mixed-data type columns are detected

In [32]:
# checking missing values

df_ords.isnull().sum()

order_id                       0
user_id                        0
order_number                   0
orders_day_of_week             0
order_hour_of_day              0
days_since_prior_order    206209
dtype: int64

In [34]:
# creating a subset to show the missing values

df_ords_nan=df_ords[df_ords['days_since_prior_order'].isnull()==True]

In [35]:
df_ords_nan

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order
0,2539329,1,1,2,8,NaN
11,2168274,2,1,2,11,NaN
26,1374495,3,1,1,14,NaN
39,3343014,4,1,6,11,NaN
45,2717275,5,1,3,12,NaN
...,...,...,...,...,...,...
3420930,969311,206205,1,4,12,NaN
3420934,3189322,206206,1,3,18,NaN
3421002,2166133,206207,1,6,19,NaN
3421019,2227043,206208,1,1,15,NaN
3421069,3154581,206209,1,3,11,NaN

#### Here we can see that all the customers having a NaN 'days_since_prior_order' has an 'order_number' 1. This shows that all these customers are infact new customers. Hence, these missing values doesn't need to be addressed and I would prefer not to change these NaN values and leave it as it is.

In [36]:
# checking for duplicate values

df_ords_dup=df_ords[df_ords.duplicated()]

In [37]:
df_ords_dup

Empty DataFrame
Columns: [order_id, user_id, order_number, orders_day_of_week, order_hour_of_day, days_since_prior_order]
Index: []

#### no duplicate records detected

In [39]:
# exporting the cleaned 'df_ords' dataframe

df_ords.to_csv(os.path.join(path,'Prepared Data','ords_checked.csv'))